#---------------------------------------------------
print'---------------------------------------------';
#---------------------------------------------------

import os

thisFile = 'Python_08_FileSystem_03.py'
fullPath = os.path.join(os.getcwd(), thisFile)

def print_file():
    with open(fullPath) as file:
        print(file.read());

#---------------------------------------------------
print'---------------------------------------------'
#---------------------------------------------------

with open(fullPath, 'a') as file:
    file.write('#');

print_file();

#---------------------------------------------------
print'---------------------------------------------'
#---------------------------------------------------

# 숫자 배열을 문자열 배열로 만들고, 문자열 하나로 만들기
lotto = [str(num) for num in range(1,7)];
print(','.join(lotto));

# value에 key로 지정한 함수 적용해서 문자열 배열을 만들고, 문자열 하나로 만들기
lotto = list(map(str, range(1, 7)));
print(','.join(lotto));
print(','.join(map(str, range(1, 7))));

#---------------------------------------------------
print'---------------------------------------------'
#---------------------------------------------------
#Write Test : ####