# -*- coding: utf-8 -*-
import sys
import io

#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

#x = int(input('Please enter an integer: '))
x = 0
if x < 0:
    print('Negative changed to zero')
elif x == 0:
    print('Zero')
elif x == 1:
    print('Single')
else:
    print('More')
    
#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

words = ['cat', 'window', 'defenestrate']
for w in words:
    print(w, len(w))
print('---------------------------------------------')
# words의 사본을 만들어서 for 실행,, [:]은 슬라이딩해서 0 ~ len 까지 리스트를 만들어 반환해주므로 사본이 생성된다.
for w in words[:]:
#for w in words:
    if w == 'cat':
        words.insert(len(words), 'dog')
    print(w, len(w))
print('---------------------------------------------')
print(words)

#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

for i in range(5):
    print(i)
print('---------------------------------------------')
for i in range(5, 10):
    print(i)
print('---------------------------------------------')
for i in range(10, 20, 2):
    print(i)
print('---------------------------------------------')
for i in range(-10, -20, -2):
    print(i)

#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

for i in range(len(words)):
    print(words[i])

print('---------------------------------------------')

# 리스트처럼 보이지만 리스트가 아니라 이터러블이다.
print(range(10))

print('---------------------------------------------')

# 이터러블로 리스트를 만든다.
print(list(range(10)))

#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

# 소수찾기
for n in range(2, 10):
    for x in range(2, n):
        if n % x == 0:
            print(n, 'equals', x, '*', n//x)
            break
    else:
        print(n, 'is a prime number')

print('---------------------------------------------')

for n in range(2, 10):
    if n % 2 == 0:
        print('Found an even number : ', n)
        continue
    print('Found an odd number : ', n)

#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------

# Ctrl + C 입력시 까지 무한대기
# while True:
#    pass

class MyEmptyClass:
    pass
    
def MyEmptyFunction:
    pass
    
#---------------------------------------------------
print('---------------------------------------------')
#---------------------------------------------------