#!/usr/bin/env python3

#---------------------------------------------------
print('---------------------------------------------');
#---------------------------------------------------

# 인터프리터 실행(Interpreter run)
# > python3
# > python3 args ... ... // sys.argv
# ... 커맨드 옵션 : https://docs.python.org/ko/3/using/cmdline.html#using-on-general

# 인터프리터 종료(Interpreter exit)
# >>> quit()
# ... for windows
# >>> ctrl + d
# ... for mac
# >>> control + z

#---------------------------------------------------
print('---------------------------------------------');
#---------------------------------------------------

# python(.py) 파일의 인코딩
# ... 파이썬은 기본적으로 UTF-8으로 인코딩 된 것으로 간주한다.

# ... 다른 인코딩을 사용하려면 아래와 같이 할 수 있다.
# -*- coding: encoding -*- : 파일의 첫 줄에
# -*- coding: cp1252 -*-

# ... 파일의 첫줄에 셔뱅(shebang)이 들어가면 인코딩 명령은 두번째 줄에 사용해야한다.
#!/usr/bin/env python3
# -*- coding: cp1252 -*-

# 인코딩 종류 : utf-8, cp1252, cp949, euc-kr

# 문자열의 인코딩 코드변경
# >>> s = u'하하하하하'
# >>> s.endcode('utf-8')
# >>> type(s)

#---------------------------------------------------
print('---------------------------------------------');
#---------------------------------------------------

# 문제
# --------------------------------------------------------------------------
# import sys
# print(sys.argv[1]) 
# 의 결과가 'Hello Python'이 출력될 수 있도록 파이썬을 인터프리터로 실행하여라.
# => python3 - 'Hello Python'
# --------------------------------------------------------------------------
# 이 py 파일의 인코딩을 cp1252로 인식하도록 코딩하여라.
# => -*- coding: cp1252 -*-
# --------------------------------------------------------------------------
# argv로 전달받은 모든 인자값들의 데이터 형을 출력하고, utf-8 타입으로 인코딩을 변환하여라.
# => import sys
# => for(sys.argv):
# =>    print(type(element))
# =>    element.encode('utf-8')
# --------------------------------------------------------------------------

#---------------------------------------------------
print('---------------------------------------------');
#---------------------------------------------------
